package com.mams.mamscommon.controller;

import com.mams.mamscommon.entity.School;
import com.mams.mamscommon.mapper.SchoolMapper;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.web.bind.annotation.CrossOrigin;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RestController;

import javax.annotation.Resource;

/**
 * @ClassName UserController
 * @Description TODO
 * @Author TangCaiping
 * @Date 2021/2/2 11:35
 * @Version 1.0
 * CrossOrigin: 解决跨域问题
 *
 */
@RestController
@RequestMapping("/common")
@CrossOrigin
public class UserController {
	@Resource
	SchoolMapper mapper;
	@RequestMapping("/index")
	public String index() {
		String s="150\t河北大学\t4113010075\t河北省\t保定市\t本科\n" +
				"151\t河北工程大学\t4113010076\t河北省\t邯郸市\t本科\n" +
				"152\t河北地质大学\t4113010077\t河北省\t石家庄市\t本科\n" +
				"153\t河北工业大学\t4113010080\t河北省\t天津市\t本科\n" +
				"154\t华北理工大学\t4113010081\t河北省\t唐山市\t本科\n" +
				"155\t河北科技大学\t4113010082\t河北省\t石家庄市\t本科\n" +
				"156\t河北建筑工程学院\t4113010084\t河北省\t张家口市\t本科\n" +
				"157\t河北水利电力学院\t4113010085\t河北省\t沧州市\t本科\n" +
				"158\t河北农业大学\t4113010086\t河北省\t保定市\t本科\n" +
				"159\t河北医科大学\t4113010089\t河北省\t石家庄市\t本科\n" +
				"160\t河北北方学院\t4113010092\t河北省\t张家口市\t本科\n" +
				"161\t承德医学院\t4113010093\t河北省\t承德市\t本科\n" +
				"162\t河北师范大学\t4113010094\t河北省\t石家庄市\t本科\n" +
				"163\t保定学院\t4113010096\t河北省\t保定市\t本科\n" +
				"164\t河北民族师范学院\t4113010098\t河北省\t承德市\t本科\n" +
				"165\t唐山师范学院\t4113010099\t河北省\t唐山市\t本科\n" +
				"166\t廊坊师范学院\t4113010100\t河北省\t廊坊市\t本科\n" +
				"167\t衡水学院\t4113010101\t河北省\t衡水市\t本科\n" +
				"168\t石家庄学院\t4113010102\t河北省\t石家庄市\t本科\n" +
				"169\t邯郸学院\t4113010103\t河北省\t邯郸市\t本科\n" +
				"170\t邢台学院\t4113010104\t河北省\t邢台市\t本科\n" +
				"171\t沧州师范学院\t4113010105\t河北省\t沧州市\t本科\n" +
				"172\t石家庄铁道大学\t4113010107\t河北省\t石家庄市\t本科\n" +
				"173\t燕山大学\t4113010216\t河北省\t秦皇岛市\t本科\n" +
				"174\t河北科技师范学院\t4113010798\t河北省\t秦皇岛市\t本科\n" +
				"175\t唐山学院\t4113011033\t河北省\t唐山市\t本科\n" +
				"176\t华北科技学院\t4113011104\t应急管理部\t廊坊市\t本科\n" +
				"177\t中国人民警察大学\t4113011105\t公安部\t廊坊市\t本科\n" +
				"178\t河北体育学院\t4113011236\t河北省\t石家庄市\t本科\n" +
				"179\t河北金融学院\t4113011420\t河北省\t保定市\t本科\n" +
				"180\t北华航天工业学院\t4113011629\t河北省\t廊坊市\t本科\n" +
				"181\t防灾科技学院\t4113011775\t中国地震局\t廊坊市\t本科\n" +
				"182\t河北经贸大学\t4113011832\t河北省\t石家庄市\t本科\n" +
				"183\t中央司法警官学院\t4113011903\t司法部\t保定市\t本科\n" +
				"184\t河北传媒学院\t4113012784\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"185\t河北工程技术学院\t4113012796\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"186\t河北美术学院\t4113013075\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"187\t河北科技学院\t4113013391\t河北省教育厅\t保定市\t本科\t民办\n" +
				"188\t河北外国语学院\t4113013402\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"189\t河北大学工商学院\t4113013404\t河北省教育厅\t保定市\t本科\t民办\n" +
				"190\t华北理工大学轻工学院\t4113013408\t河北省教育厅\t唐山市\t本科\t民办\n" +
				"191\t河北科技大学理工学院\t4113013409\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"192\t河北师范大学汇华学院\t4113013411\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"193\t河北经贸大学经济管理学院\t4113013414\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"194\t河北医科大学临床学院\t4113013415\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"195\t华北电力大学科技学院\t4113013417\t河北省教育厅\t保定市\t本科\t民办\n" +
				"196\t河北工程大学科信学院\t4113013578\t河北省教育厅\t邯郸市\t本科\t民办\n" +
				"197\t河北工业大学城市学院\t4113013584\t河北省教育厅\t廊坊市\t本科\t民办\n" +
				"198\t燕山大学里仁学院\t4113013592\t河北省教育厅\t秦皇岛市\t本科\t民办\n" +
				"199\t石家庄铁道大学四方学院\t4113013593\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"200\t河北地质大学华信学院\t4113013594\t河北省教育厅\t石家庄市\t本科\t民办\n" +
				"201\t河北农业大学现代科技学院\t4113013595\t河北省教育厅\t保定市\t本科\t民办\n" +
				"202\t华北理工大学冀唐学院\t4113013596\t河北省教育厅\t唐山市\t本科\t民办\n" +
				"203\t保定理工学院\t4113013891\t河北省教育厅\t保定市\t本科\t民办\n" +
				"204\t燕京理工学院\t4113013895\t河北省教育厅\t廊坊市\t本科\t民办\n" +
				"205\t北京中医药大学东方学院\t4113013899\t河北省教育厅\t廊坊市\t本科\t民办\n" +
				"206\t北京交通大学海滨学院\t4113014202\t河北省教育厅\t沧州市\t本科\t民办\n" +
				"207\t河北东方学院\t4113014225\t河北省教育厅\t廊坊市\t本科\t民办\n" +
				"208\t河北中医学院\t4113014432\t河北省\t石家庄市\t本科\n" +
				"209\t张家口学院\t4113014458\t河北省\t张家口市\t本科\n" +
				"210\t河北环境工程学院\t4213051721\t河北省\t秦皇岛市\t本科\n" +
				"211\t河北工业职业技术学院\t4113010873\t河北省\t石家庄市\t专科\n" +
				"212\t邯郸职业技术学院\t4113011034\t河北省\t邯郸市\t专科\n" +
				"213\t石家庄职业技术学院\t4113011238\t河北省\t石家庄市\t专科\n" +
				"214\t张家口职业技术学院\t4113011423\t河北省\t张家口市\t专科\n" +
				"215\t承德石油高等专科学校\t4113011777\t河北省\t承德市\t专科\n" +
				"216\t邢台职业技术学院\t4113011821\t河北省\t邢台市\t专科\n" +
				"217\t河北软件职业技术学院\t4113012352\t河北省\t保定市\t专科\n" +
				"218\t河北石油职业技术学院\t4113012367\t河北省\t廊坊市\t专科\n" +
				"219\t河北建材职业技术学院\t4113012389\t河北省\t秦皇岛市\t专科\n" +
				"220\t河北政法职业学院\t4113012408\t河北省\t石家庄市\t专科\n" +
				"221\t沧州职业技术学院\t4113012415\t河北省\t沧州市\t专科\n" +
				"222\t河北能源职业技术学院\t4113012418\t河北省\t唐山市\t专科\n" +
				"223\t石家庄铁路职业技术学院\t4113012424\t河北省\t石家庄市\t专科\n" +
				"224\t保定职业技术学院\t4113012543\t河北省\t保定市\t专科\n" +
				"225\t秦皇岛职业技术学院\t4113012773\t河北省\t秦皇岛市\t专科\n" +
				"226\t石家庄工程职业学院\t4113012782\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"227\t石家庄城市经济职业学院\t4113012783\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"228\t唐山职业技术学院\t4113012785\t河北省\t唐山市\t专科\n" +
				"229\t衡水职业技术学院\t4113012786\t河北省\t衡水市\t专科\n" +
				"230\t唐山工业职业技术学院\t4113012787\t河北省\t唐山市\t专科\n" +
				"231\t邢台医学高等专科学校\t4113012884\t河北省\t邢台市\t专科\n" +
				"232\t河北艺术职业学院\t4113012885\t河北省\t石家庄市\t专科\n" +
				"233\t河北旅游职业学院\t4113012887\t河北省\t承德市\t专科\n" +
				"234\t石家庄财经职业学院\t4113013070\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"235\t河北交通职业技术学院\t4113013071\t河北省\t石家庄市\t专科\n" +
				"236\t河北化工医药职业技术学院\t4113013072\t河北省\t石家庄市\t专科\n" +
				"237\t石家庄信息工程职业学院\t4113013073\t河北省\t石家庄市\t专科\n" +
				"238\t河北对外经贸职业学院\t4113013074\t河北省\t秦皇岛市\t专科\n" +
				"239\t保定电力职业技术学院\t4113013392\t河北省\t保定市\t专科\n" +
				"240\t河北机电职业技术学院\t4113013393\t河北省\t邢台市\t专科\n" +
				"241\t渤海石油职业学院\t4113013394\t河北省\t沧州市\t专科\n" +
				"242\t廊坊职业技术学院\t4113013395\t河北省\t廊坊市\t专科\n" +
				"243\t唐山科技职业技术学院\t4113013396\t河北省\t唐山市\t专科\n" +
				"244\t石家庄邮电职业技术学院\t4113013397\t河北省\t石家庄市\t专科\n" +
				"245\t河北公安警察职业学院\t4113013398\t河北省\t石家庄市\t专科\n" +
				"246\t石家庄工商职业学院\t4113013399\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"247\t石家庄理工职业学院\t4113013400\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"248\t石家庄科技信息职业学院\t4113013403\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"249\t河北司法警官职业学院\t4113013690\t河北省\t邯郸市\t专科\n" +
				"250\t沧州医学高等专科学校\t4113013779\t河北省\t沧州市\t专科\n" +
				"251\t河北女子职业技术学院\t4113013822\t河北省\t石家庄市\t专科\n" +
				"252\t石家庄医学高等专科学校\t4113014018\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"253\t石家庄经济职业学院\t4113014047\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"254\t冀中职业学院\t4113014103\t河北省\t保定市\t专科\n" +
				"255\t石家庄人民医学高等专科学校\t4113014158\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"256\t石家庄科技工程职业学院\t4113014185\t河北省\t石家庄市\t专科\n" +
				"257\t河北劳动关系职业学院\t4113014208\t河北省\t石家庄市\t专科\n" +
				"258\t石家庄科技职业学院\t4113014213\t河北省教育厅\t石家庄市\t专科\t民办\n" +
				"259\t泊头职业学院\t4113014259\t河北省\t沧州市\t专科\n" +
				"260\t宣化科技职业学院\t4113014260\t河北省\t张家口市\t专科\n" +
				"261\t廊坊燕京职业技术学院\t4113014280\t河北省\t廊坊市\t专科\n" +
				"262\t承德护理职业学院\t4113014281\t河北省\t承德市\t专科\n" +
				"263\t石家庄幼儿师范高等专科学校\t4113014328\t河北省\t石家庄市\t专科\n" +
				"264\t廊坊卫生职业学院\t4113014335\t河北省\t廊坊市\t专科\n" +
				"265\t河北轨道运输职业技术学院\t4113014396\t河北省\t石家庄市\t专科\n" +
				"266\t保定幼儿师范高等专科学校\t4113014460\t河北省\t保定市\t专科\n" +
				"267\t河北工艺美术职业学院\t4113014471\t河北省\t保定市\t专科\n" +
				"268\t渤海理工职业学院\t4113014472\t河北省教育厅\t沧州市\t专科\t民办\n" +
				"269\t唐山幼儿师范高等专科学校\t4113014586\t河北省\t唐山市\t专科\n" +
				"270\t曹妃甸职业技术学院\t4113014601\t河北省教育厅\t唐山市\t专科\t民办\n" +
				"271\t承德应用技术职业学院\t4113014632\t河北省\t承德市\t专科";
		String[] ss=s.split("\n");
		for (int i=4;i<ss.length;i++){
			String schools=ss[i];
			String[] json=schools.split("\t");
			School school=new School();
			school.setId(json[0]);
			school.setSchoolName(json[1]);
			school.setSchoolCode(json[2]);
			school.setLocalAddress(json[4]);
			school.setBelongingDepartment(json[3]);
			school.setLevel(json[5]);
			mapper.insert(school);
		}
		return "tyrt";
	}
	
	
}
